Repository: hbvit7/Learn-Vim
Catalog: _po/*/*.po
Languages: ru

source: Learn Vim (the Smart Way)
ru: Изучаем Vim (правильно)

source: Whatâs This?
ru: Что это?

source: _Learn Vim (the Smart Way)_ is a guide to learn the good parts of Vim.
ru: _Изучаем Vim (правильно)_ - это руководство по изучению лучших сторон Vim.

source: There are many places to learn Vim: the `vimtutor` is a great place to start and the `help` manual has all the references you will ever need. However, the average user needs something more than `vimtutor` and less than the `help` manual. This guide attempts to bridge that gap by highlighting only the key features to learn the most useful parts of Vim in the least time possible.
ru: Существует много материалов для изучения Vim: `vimtutor` — отличной выбор для начала, а в справочном руководстве `help` содержатся все справочные материалы, которые вам когда-либо понадобятся. Тем не менее, среднему пользователю нужно что-то большее, чем `vimtutor`, и меньшее, чем справочное руководство `help`. Это руководство пытается преодолеть этот разрыв, выделяя только ключевые функции, для изучения наиболее полезных сторон Vim за максимально короткое время.

source: This guide is written for both beginner and advanced Vimmers. It starts out with broad and simple concepts and ends with specific and advanced concepts. If youâre an advanced user already, I would encourage you to read this guide from start to finish anyway, because you will learn something new!
ru: Это руководство написано как для начинающих, так и для продвинутых пользователей Vim. Оно начинается с широких и простых и заканчивается конкретными и продвинутыми понятиями. Если вы уже опытный пользователь, я бы в любом случае посоветовал вам прочитать это руководство от начала до конца, потому что вы узнаете что-то новое!

source: I Want More Vim Tips!
ru: Я хочу больше советов по Vim!

source: Follow https://twitter.com/learnvim[@learnvim] for updates, Vim tips, etc.
ru: Следите за https://twitter.com/learnvim[@learnvim] для получения обновлений, советов по Vim и т. д.

source: Support This Project
ru: Поддержите этот проект

source: This guide is and will always be free.
ru: Это руководство есть и всегда будет бесплатным.

source: If you want to financially support this project, you can https://leanpub.com/learnvim[purchase this guide on Leanpub].
ru: Если вы хотите финансово поддержать этот проект, вы можете https://leanpub.com/learnvim[купить это руководство на английском языке на Leanpub].

source: Table Of Contents
ru: Оглавление

source: Prologue
ru: Пролог

source: link:./ch00_read_this_first.md[Ch 0 - Read This First]
ru: link:./ch00_read_this_first.md[Глава 0 - Сначала прочитайте это]

source: Part 1: Learn Vim the Smart Way
ru: Часть 1: Изучаем Vim правильно

source: link:./ch01_starting_vim.md[Ch 1 - Starting Vim]
ru: link:./ch01_starting_vim.md[Глава 1 - Запуск Vim]

source: link:./ch02_buffers_windows_tabs.md[Ch 2 - Buffers&#44; Windows&#44; and Tabs]
ru: link:./ch02_buffers_windows_tabs.md[Глава 2 - Буферы, окна и вкладки]

source: link:./ch03_searching_files.md[Ch 3 - Opening and Searching Files]
ru: link:./ch03_searching_files.md[Глава 3 – Открытие и поиск файлов]

source: link:./ch04_vim_grammar.md[Ch 4 - Vim Grammar]
ru: link:./ch04_vim_grammar.md[Глава 4 - Грамматика Vim]

source: link:./ch05_moving_in_file.md[Ch 5 - Moving in a File]
ru: link:./ch05_moving_in_file.md[Глава 5 - Перемещение в файле]

source: link:./ch06_insert_mode.md[Ch 6 - Insert Mode]
ru: link:./ch06_insert_mode.md[Глава 6 - Режим вставки]

source: link:./ch07_the_dot_command.md[Ch 7 - The Dot command]
ru: link:./ch07_the_dot_command.md[Глава 7 - Команда Dot]

source: link:./ch08_registers.md[Ch 8 - Registers]
ru: link:./ch08_registers.md[Глава 8 - Регистры]

source: link:./ch09_macros.md[Ch 9 - Macros]
ru: link:./ch09_macros.md[Глава 9 - Макросы]

source: link:./ch10_undo.md[Ch 10 - Undo]
ru: link:./ch10_undo.md[Глава 10 - Отмена]

source: link:./ch11_visual_mode.md[Ch 11 - Visual Mode]
ru: link:./ch11_visual_mode.md[Глава 11 - Визуальный режим]

source: link:./ch12_search_and_substitute.md[Ch 12 - Search and Substitute]
ru: link:./ch12_search_and_substitute.md[Глава 12 - Поиск и замена]

source: link:./ch13_the_global_command.md[Ch 13 - The Global Command]
ru: link:./ch13_the_global_command.md[Глава 13 - Глобальная команда]

source: link:./ch14_external_commands.md[Ch 14 - External Commands]
ru: link:./ch14_external_commands.md[Глава 14 - Внешние команды]

source: link:./ch15_command-line_mode.md[Ch 15 - Command-line Mode]
ru: link:./ch15_command-line_mode.md[Глава 15 - Режим командной строки]

source: link:./ch16_tags.md[Ch 16 - Tags]
ru: link:./ch16_tags.md[Глава 16 - Теги]

source: link:./ch17_fold.md[Ch 17 - Fold]
ru: link:./ch17_fold.md[Глава 17 - Сворачивание]

source: link:./ch18_git.md[Ch 18 - Git]
ru: link:./ch18_git.md[Глава 18 - Git]

source: link:./ch19_compile.md[Ch 19 - Compile]
ru: link:./ch19_compile.md[Глава 19 - Компиляция]

source: link:./ch20_views_sessions_viminfo.md[Ch 20 - Views&#44; Sessions&#44; and Viminfo]
ru: link:./ch20_views_sessions_viminfo.md​​[Глава 20 - Просмотры, сеансы и Viminfo]

source: link:./ch21_multiple_file_operations.md[Ch 21 - Multiple File Operations]
ru: link:./ch21_multiple_file_operations.md[Глава 21 - Операции с несколькими файлами]

source: Part 2: Customize Vim the Smart Way
ru: Часть 2. Правильная настройка Vim

source: link:./ch22_vimrc.md[Ch 22 - Vimrc]
ru: link:./ch22_vimrc.md[Глава 22 - Vimrc]

source: link:./ch23_vim_packages.md[Ch 23 - Vim Packages]
ru: link:./ch23_vim_packages.md[Глава 23 - Пакеты Vim]

source: link:./ch24_vim_runtime.md[Ch 24 - Vim Runtime]
ru: link:./ch24_vim_runtime.md[Глава 24 - Среда выполнения Vim]

source: Part 3: Learn Vimscript the Smart Way
ru: Часть 3. Изучаем Vimscript правильно

source: link:./ch25_vimscript_basic_data_types.md[Ch 25 - Vimscript Basic Data Types]
ru: link:./ch25_vimscript_basic_data_types.md[Глава 25 - Основные типы данных Vimscript]

source: link:./ch26_vimscript_conditionals_and_loops.md[Ch 26 - Vimscript Conditionals And Loops]
ru: link:./ch26_vimscript_conditionals_and_loops.md[Глава 26 - Условные выражения и циклы Vimscript]

source: link:./ch27_vimscript_variable_scopes.md[Ch 27 - Vimscript Variable Scopes]
ru: link:./ch27_vimscript_variable_scopes.md[Глава 27 - Области видимости переменных Vimscript]

source: link:./ch28_vimscript_functions.md[Ch 28 - Vimscript Functions]
ru: link:./ch28_vimscript_functions.md[Ch 28 - функции Vimpscript]

source: link:./ch29_plugin_example_writing-a-titlecase-plugin.md[Ch 29 - Plugin Example: Writing a Titlecase Plugin]
ru: link:./ch29_plugin_example_writing-a-titlecase-plugin.md[Глава 29 - Пример плагина: написание плагина Titlecase]

source: Translations
ru: Переводы

source: https://github.com/wsdjeg/Learn-Vim_zh_cn[Learn-Vim ä¸­æç¿»è¯](`zh-CN`)
ru: https://github.com/wsdjeg/Learn-Vim_zh_cn[Изучаем Vim правильно на китайском](`zh-CN`)

source: https://github.com/victorhck/learn-Vim-es[Learn-Vim Spanish](`es`)
ru: https://github.com/victorhck/learn-Vim-es[Изучаем Vim правильно на испанском](`es`)

source: License & Copyright
ru: Лицензия и авторские права

source: The materials here are all Â© 2020-2021 Igor Irianto.
ru: Все размещенные здесь материалы принадлежат © 2020-2021 Игорю Ирианто.

source: This work is licensed under a Creative Commons Attribution-NonCommercial-ShareAlike 4.0 International.
ru: Эта работа находится под лицензией Creative Commons Attribution-NonCommercial-ShareAlike 4.0 International.
